supplement.org
** Obtaining standard errors via multivariate delta method

As seen above, each effects of interest is estimated as a scalar-valued, non-linear function of estiamted coefficients for the mediator model and the outcome model. Thus, we can obtain the standard error of each effect estimate using the variance covariance matrix for the coefficients and multivariate delta method cite:hoefWhoInventedDelta2012.\\

Let the scalar quantity of interest be $Q$, a function of parameter vector $(\bbeta^{T},\btheta^{T})^{T}$. Then, its gradient (vector of partial derivatives) with respect to the parameter vector $(\bbeta^{T},\btheta^{T})^{T}$ is the following.\\

\begin{align*}
\nabla Q &= \frac{\partial Q}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
         &= \begin{bmatrix}
           \frac{\partial Q}{\partial \beta_{0}}\\[6pt]
           \frac{\partial Q}{\partial \beta_{1}}\\[6pt]
           \frac{\partial Q}{\partial \bbeta_{2}}\\[6pt]
           \frac{\partial Q}{\partial \theta_{0}}\\[6pt]
           \frac{\partial Q}{\partial \theta_{1}}\\[6pt]
           \frac{\partial Q}{\partial \theta_{2}}\\[6pt]
           \frac{\partial Q}{\partial \theta_{3}}\\[6pt]
           \frac{\partial Q}{\partial \btheta_{4}}\\
         \end{bmatrix}\\
\end{align*}

In the case of a linear mediator model and a non-linear outcome model, there is an additional element $\frac{\partial Q}{\partial \sigma^{2}}$ at the bottom of the gradient vector.\\

By the large sample approximation using the multivariate delta method, the variance of the quantity of interest evaluated at the MLEs $(\bbetahat^{T},\bthetahat^{T})^{T}$ is the following.

\begin{align*}
  \underbrace{Var \left[ Q\left\{ (\bbetahat^{T},\bthetahat^{T})^{T} \right\} \right]}_{\text{scalar}}
  &\approx
  \underbrace{\left[ \nabla Q \left( (\bbetahat^{T},\bthetahat^{T})^{T} \right) \right]^{T}}_{\text{row vector}}
  \underbrace{Var((\bbetahat^{T},\bthetahat^{T})^{T})}_{\text{matrix}}
  \underbrace{\left[ \nabla Q \left( (\bbetahat^{T},\bthetahat^{T})^{T} \right) \right]}_{\text{column vector}}
\end{align*}

This expression is abbreviated as $\Gamma\Sigma\Gamma'$ in cite:vanderweeleExplanationCausalInference2015,valeriMediationAnalysisAllowing2013,valeriSASMacroCausal2015. In these references, the treatment contrast ($a_{1}-a_{0}$) is factored out from $\nabla Q \left( (\bbetahat^{T},\bthetahat^{T})^{T} \right)$ when possible.

** Linear mediator model, linear outcome model
*** Effect formulas
The function =calc_myreg_mreg_linear_yreg_linear_est()= implements the effect formulas in cite:vanderweeleExplanationCausalInference2015 (p466).

\begin{align*}
  &\text{Models}\\
  E[Y|A=a,M=m,\bC=\bc] &= \theta_{0} + \theta_{1}a + \theta_{2}m + \theta_{3}am + \btheta_{4}^{T}\bc\\
  E[M|A=a,\bC=\bc] &= \beta_{0} + \beta_{1}a + \bbeta_{2}^{T}\bc\\
  \\
  &\text{Effects}\\
  CDE(m) &= E[Y_{a_{1},m} | \bC = \bc] - E[Y_{a_{0},m} | \bC = \bc]\\
  &= (\theta_{1} + \theta_{3}m)(a_{1} - a_{0})\\
  \\
  PNDE &= E[Y_{a_{1},M_{a_{0}}} | \bC = \bc] - E[Y_{a_{0},M_{a_{0}}} | \bC = \bc]\\
  &= \left\{ \theta_{1} + \theta_{3}(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc) \right\} (a_{1} - a_{0})\\
  TNIE &= E[Y_{a_{1},M_{a_{1}}} | \bC = \bc] - E[Y_{a_{1},M_{a_{0}}} | \bC = \bc]\\
  &= \beta_{1}(\theta_{2} + \theta_{3}a_{1})(a_{1} - a_{0})\\
  \\
  TNDE &= E[Y_{a_{1},M_{a_{1}}} | \bC = \bc] - E[Y_{a_{0},M_{a_{1}}} | \bC = \bc]\\
  &= \left\{ \theta_{1} + \theta_{3}(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc) \right\} (a_{1} - a_{0})\\
  PNIE &= E[Y_{a_{0},M_{a_{1}}} | \bC = \bc] - E[Y_{a_{0},M_{a_{0}}} | \bC = \bc]\\
  &= \beta_{1}(\theta_{2} + \theta_{3}a_{0})(a_{1} - a_{0})\\
  \\
  TE &= PNDE + TNIE\\
  PM &= \frac{TNIE}{PNDE + TNIE}\\
\end{align*}

*** Variance formulas
The function =calc_myreg_mreg_linear_yreg_linear_se()= implements the standard error formulas in cite:vanderweeleExplanationCausalInference2015 (p466).

\begin{align*}
  (a_{1}-a_{0})\Gamma_{CDE(m)}
  &= \frac{\partial CDE(m)}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      0\\
      0\\
      \b0\\
      0\\
      1\\
      0\\
      m\\
      \b0\\
    \end{bmatrix}\\
  \\
  (a_{1}-a_{0})\Gamma_{PNDE}
  &= \frac{\partial PNDE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      \theta_{3}\\
      \theta_{3}a_{0}\\
      \theta_{3}\bc\\
      0\\
      1\\
      0\\
      \beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc\\
      \b0\\
    \end{bmatrix}\\
  (a_{1}-a_{0})\Gamma_{TNIE}
  &= \frac{\partial TNIE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      0\\
      \theta_{2} + \theta_{3}a_{1}\\
      \b0\\
      0\\
      0\\
      \beta_{1}\\
      \beta_{1}a_{1}\\
      \b0\\
    \end{bmatrix}\\
  \\
  (a_{1}-a_{0})\Gamma_{TNDE}
  &= \frac{\partial TNDE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      \theta_{3}\\
      \theta_{3}a_{1}\\
      \theta_{3}\bc\\
      0\\
      1\\
      0\\
      \beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc\\
      \b0\\
    \end{bmatrix}\\
  (a_{1}-a_{0})\Gamma_{PNIE}
  &= \frac{\partial PNIE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      0\\
      \theta_{2} + \theta_{3}a_{0}\\
      \b0\\
      0\\
      0\\
      \beta_{1}\\
      \beta_{1}a_{0}\\
      \b0\\
    \end{bmatrix}\\
  \\
  (a_{1}-a_{0})\Gamma_{TE}
  &= \frac{\partial TE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= \frac{\partial (PNDE+TNIE)}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= (a_{1}-a_{0})(\Gamma_{PNDE} + \Gamma_{TNIE})\\
  \\
  (a_{1}-a_{0})\Gamma_{PM}
  &= \frac{\partial PM}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &~~~\text{By multivariate chain rule}\\
  &= \frac{\partial PM}{\partial PNDE}\frac{\partial PNDE}{\partial (\bbeta^{T},\btheta^{T})^{T}} + \frac{\partial PM}{\partial TNIE}\frac{\partial TNIE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= \frac{\partial PM}{\partial PNDE}(a_{1}-a_{0})\Gamma_{PNDE} + \frac{\partial PM}{\partial TNIE}(a_{1}-a_{0})\Gamma_{TNIE}\\
  &= \frac{-TNIE}{(PNDE+TNIE)^{2}}(a_{1}-a_{0})\Gamma_{PNDE} + \frac{PNDE}{(PNDE+TNIE)^{2}}(a_{1}-a_{0})\Gamma_{TNIE}\\
  &= (a_{1}-a_{0}) \frac{-TNIE~\Gamma_{PNDE} + PNDE~\Gamma_{TNIE}}{(PNDE+TNIE)^{2}}\\
  \\
  &\text{Variance-covariance matrix from two models}\\
  \bSigma &=
           \begin{bmatrix}
             \bSigma_{\bbeta} & 0 \\
             0 & \bSigma_{\btheta} \\
           \end{bmatrix}\\
  SE(\widehat{CDE}(m)) &= \sqrt{\Gamma_{CDE(m)}^{T} ~\bSigma~ \Gamma_{CDE(m)}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{PNDE}) &= \sqrt{\Gamma_{PNDE}^{T} ~\bSigma~ \Gamma_{PNDE}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{TNIE}) &= \sqrt{\Gamma_{TNIE}^{T} ~\bSigma~ \Gamma_{TNIE}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{TNDE}) &= \sqrt{\Gamma_{TNDE}^{T} ~\bSigma~ \Gamma_{TNDE}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{PNIE}) &= \sqrt{\Gamma_{PNIE}^{T} ~\bSigma~ \Gamma_{PNIE}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{TE}) &= \sqrt{\Gamma_{TE}^{T} ~\bSigma~ \Gamma_{TE}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{PM}) &= \sqrt{\Gamma_{PM}^{T} ~\bSigma~ \Gamma_{PM}} ~ \abs{a_{1} - a_{0}}\\
\end{align*}


** Linear mediator model, non-linear outcome model
