supplement.org
*** Effect formulas
The function =calc_myreg_mreg_linear_yreg_logistic_est()= implements the effect formulas in cite:vanderweeleExplanationCausalInference2015 (p468).

\begin{align*}
  &\text{Models}\\
  \logit(E[Y|A=a,M=m,\bC=\bc]) &= \theta_{0} + \theta_{1}a + \theta_{2}m + \theta_{3}am + \btheta_{4}^{T}\bc\\
  E[M|A=a,\bC=\bc] &= \beta_{0} + \beta_{1}a + \bbeta_{2}^{T}\bc\\
  \\
  &\text{Effects on link function scale}\\
  CDE(m) &= \logit(E[Y_{a_{1},m} | \bC = \bc]) - \logit(E[Y_{a_{0},m} | \bC = \bc])\\
  &= (\theta_{1} + \theta_{3}m)(a_{1} - a_{0})\\
  \\
  PNDE &= \logit(E[Y_{a_{1},M_{a_{0}}} | \bC = \bc]) - \logit(E[Y_{a_{0},M_{a_{0}}} | \bC = \bc])\\
  &\approx \left\{ \theta_{1} + \theta_{3}(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc + \theta_{2}\sigma^{2}) \right\} (a_{1} - a_{0}) + \frac{1}{2} \theta_{3}^{2}\sigma^{2}(a_{1}^{2} - a_{0}^{2})\\
  TNIE &= \logit(E[Y_{a_{1},M_{a_{1}}} | \bC = \bc]) - \logit(E[Y_{a_{1},M_{a_{0}}} | \bC = \bc])\\
  &\approx \beta_{1}(\theta_{2} + \theta_{3}a_{1})(a_{1} - a_{0})\\
  \\
  TNDE &= \logit(E[Y_{a_{1},M_{a_{1}}} | \bC = \bc]) - \logit(E[Y_{a_{0},M_{a_{1}}} | \bC = \bc])\\
  &\approx \left\{ \theta_{1} + \theta_{3}(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc + \theta_{2}\sigma^{2}) \right\} (a_{1} - a_{0}) + \frac{1}{2} \theta_{3}^{2}\sigma^{2}(a_{1}^{2} - a_{0}^{2})\\
  PNIE &= \logit(E[Y_{a_{0},M_{a_{1}}} | \bC = \bc]) - \logit(E[Y_{a_{0},M_{a_{0}}} | \bC = \bc])\\
  &\approx \beta_{1}(\theta_{2} + \theta_{3}a_{0})(a_{1} - a_{0})\\
  \\
  TE &= PNDE + TNIE\\
  PM &= \frac{\exp(PNDE)(\exp(TNIE) - 1)}{\exp(PNDE)\exp(TNIE) - 1}\\
\end{align*}

*** Variance formulas
The function =calc_myreg_mreg_linear_yreg_logistic_se()= implements the standard error formulas in cite:vanderweeleExplanationCausalInference2015 (p468).

\begin{align*}
  (a_{1}-a_{0})\Gamma_{CDE(m)}
  &= \frac{\partial CDE(m)}{\partial (\bbeta^{T},\btheta^{T},\sigma^2)^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      0\\
      0\\
      \b0\\
      0\\
      1\\
      0\\
      m\\
      \b0\\
      0\\
    \end{bmatrix}\\
  \\
  (a_{1}-a_{0})\Gamma_{PNDE}
  &= \frac{\partial PNDE}{\partial (\bbeta^{T},\btheta^{T},\sigma^2)^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      \theta_{3}\\
      \theta_{3}a_{0}\\
      \theta_{3}\bc\\
      0\\
      1\\
      \theta_{3}\sigma^{2}\\
      \beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc + \theta_{2}\sigma^{2} + \theta_{3}\sigma^{2}(a_{0} + a_{1})\\
      \b0\\
      \theta_{3}\theta_{2} + \frac{1}{2}\theta_{3}^{2}(a_{1} + a_{0})\\
    \end{bmatrix}\\
  (a_{1}-a_{0})\Gamma_{TNIE}
  &= \frac{\partial TNIE}{\partial (\bbeta^{T},\btheta^{T},\sigma^2)^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      0\\
      \theta_{2} + \theta_{3}a_{1}\\
      \b0\\
      0\\
      0\\
      \beta_{1}\\
      \beta_{1}a_{1}\\
      \b0\\
      0\\
    \end{bmatrix}\\
  \\
  (a_{1}-a_{0})\Gamma_{TNDE}
  &= \frac{\partial TNDE}{\partial (\bbeta^{T},\btheta^{T},\sigma^2)^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      \theta_{3}\\
      \theta_{3}a_{1}\\
      \theta_{3}\bc\\
      0\\
      1\\
      \theta_{3}\sigma^{2}\\
      \beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc + \theta_{2}\sigma^{2} + \theta_{3}\sigma^{2}(a_{0} + a_{1})\\
      \b0\\
      \theta_{3}\theta_{2} + \frac{1}{2}\theta_{3}^{2}(a_{1} + a_{0})\\
    \end{bmatrix}\\
  (a_{1}-a_{0})\Gamma_{PNIE}
  &= \frac{\partial PNIE}{\partial (\bbeta^{T},\btheta^{T},\sigma^2)^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      0\\
      \theta_{2} + \theta_{3}a_{0}\\
      \b0\\
      0\\
      0\\
      \beta_{1}\\
      \beta_{1}a_{0}\\
      \b0\\
      0\\
    \end{bmatrix}\\
  \\
  (a_{1}-a_{0})\Gamma_{TE}
  &= \frac{\partial TE}{\partial (\bbeta^{T},\btheta^{T},\sigma^2)^{T}}\\
  &= \frac{\partial (PNDE+TNIE)}{\partial (\bbeta^{T},\btheta^{T},\sigma^2)^{T}}\\
  &= (a_{1}-a_{0})(\Gamma_{PNDE} + \Gamma_{TNIE})\\
  \\
  (a_{1}-a_{0})\Gamma_{PM}
  &= \frac{\partial PM}{\partial (\bbeta^{T},\btheta^{T},\sigma^2)^{T}}\\
  &~~~\text{By multivariate chain rule}\\
  &= \frac{\partial PM}{\partial PNDE}\frac{\partial PNDE}{\partial (\bbeta^{T},\btheta^{T},\sigma^2)^{T}} + \frac{\partial PM}{\partial TNIE}\frac{\partial TNIE}{\partial (\bbeta^{T},\btheta^{T},\sigma^2)^{T}}\\
  &= \frac{\partial PM}{\partial PNDE}(a_{1}-a_{0})\Gamma_{PNDE} + \frac{\partial PM}{\partial TNIE}(a_{1}-a_{0})\Gamma_{TNIE}\\
  &= - \frac{\exp(PNDE)\left\{ \exp(TNIE) - 1 \right\}}{\left\{ \exp(PNDE)\exp(TNIE) - 1 \right\}^{2}} (a_{1}-a_{0})\Gamma_{PNDE}\\
  &~~~ + \frac{\exp(PNDE)\exp(TNIE)\left\{ \exp(PNDE) - 1 \right\}}{\left\{ \exp(PNDE)\exp(TNIE) - 1 \right\}^{2}} (a_{1}-a_{0})\Gamma_{TNIE}\\
  \\
  &\text{Variance-covariance matrix from two models}\\
  \bSigma &=
           \begin{bmatrix}
             \bSigma_{\bbeta} & 0 & 0\\
             0 & \bSigma_{\btheta} & 0\\
             0 & 0 & \Sigma_{\sigma^{2}}\\
           \end{bmatrix}\\
  \Sigma_{\sigma^{2}} &= \frac{2 (\sigma^{2})^{2}}{n - p} ~ \text{where} ~ p = \text{length}(\bbeta)\\
  SE(\widehat{CDE}(m)) &= \sqrt{\Gamma_{CDE(m)}^{T} ~\bSigma~ \Gamma_{CDE(m)}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{PNDE}) &= \sqrt{\Gamma_{PNDE}^{T} ~\bSigma~ \Gamma_{PNDE}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{TNIE}) &= \sqrt{\Gamma_{TNIE}^{T} ~\bSigma~ \Gamma_{TNIE}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{TNDE}) &= \sqrt{\Gamma_{TNDE}^{T} ~\bSigma~ \Gamma_{TNDE}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{PNIE}) &= \sqrt{\Gamma_{PNIE}^{T} ~\bSigma~ \Gamma_{PNIE}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{TE}) &= \sqrt{\Gamma_{TE}^{T} ~\bSigma~ \Gamma_{TE}} ~ \abs{a_{1} - a_{0}}\\
  SE(\widehat{PM}) &= \sqrt{\Gamma_{PM}^{T} ~\bSigma~ \Gamma_{PM}} ~ \abs{a_{1} - a_{0}}\\
\end{align*}


** Logistic mediator model, linear outcome model
*** Effect formulas
The function =calc_myreg_mreg_logistic_yreg_linear_est()= implements the effect formulas in cite:vanderweeleExplanationCausalInference2015 (p471).

\begin{align*}
  &\text{Models}\\
  E[Y|A=a,M=m,\bC=\bc] &= \theta_{0} + \theta_{1}a + \theta_{2}m + \theta_{3}am + \btheta_{4}^{T}\bc\\
  \logit(E[M|A=a,\bC=\bc]) &= \beta_{0} + \beta_{1}a + \bbeta_{2}^{T}\bc\\
  \\
  &\text{Effects}\\
  CDE(m) &= E[Y_{a_{1},m} | \bC = \bc] - E[Y_{a_{0},m} | \bC = \bc]\\
  &= (\theta_{1} + \theta_{3}m)(a_{1} - a_{0})\\
  \\
  PNDE &= E[Y_{a_{1},M_{a_{0}}} | \bC = \bc] - E[Y_{a_{0},M_{a_{0}}} | \bC = \bc]\\
  &= \left\{\theta_{1}(a_{1} - a_{0}) \right\} + \left\{\theta_{3}(a_{1} - a_{0}) \right\}
    \frac
    {\exp(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}
    {1 + \exp(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}\\
  TNIE &= E[Y_{a_{1},M_{a_{1}}} | \bC = \bc] - E[Y_{a_{1},M_{a_{0}}} | \bC = \bc]\\
  &= (\theta_{2} + \theta_{3}a_{1})\left\{
    \frac
    {\exp(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}
    {1 + \exp(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}
    -
    \frac
    {\exp(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}
    {1 + \exp(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}
    \right\}
  \\
  TNDE &= E[Y_{a_{1},M_{a_{1}}} | \bC = \bc] - E[Y_{a_{0},M_{a_{1}}} | \bC = \bc]\\
  &= \left\{\theta_{1}(a_{1} - a_{0}) \right\} + \left\{\theta_{3}(a_{1} - a_{0}) \right\}
    \frac
    {\exp(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}
    {1 + \exp(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}\\
  PNIE &= E[Y_{a_{0},M_{a_{1}}} | \bC = \bc] - E[Y_{a_{0},M_{a_{0}}} | \bC = \bc]\\
  &= (\theta_{2} + \theta_{3}a_{0})\left\{
    \frac
    {\exp(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}
    {1 + \exp(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}
    -
    \frac
    {\exp(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}
    {1 + \exp(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}
    \right\}
  \\
  TE &= PNDE + TNIE\\
  PM &= \frac{TNIE}{PNDE + TNIE}\\
\end{align*}

