supplement.tex

\subsubsection{Variance formulas}
\label{sec:orgeea9ec5}
The function \texttt{calc\_myreg\_mreg\_logistic\_yreg\_logistic\_se()} implements the standard error formulas in \cite{vanderweeleExplanationCausalInference2015} (p473).

\begin{align*}
  &\text{Note the lack of the common factor $(a_{1} - a_{0})$ throughout.}\\
  \Gamma_{CDE(m)}
  &= \frac{\partial CDE(m)}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= (a_{1}-a_{0})
    \begin{bmatrix}
      0\\
      0\\
      \b0\\
      0\\
      (a_{1} - a_{0})\\
      0\\
      m(a_{1} - a_{0})\\
      \b0\\
    \end{bmatrix}\\
  \\
  Q_{PNDE} &= \frac
             {    \exp(\theta_{2} + \theta_{3}a_{1} + \beta_{0} + \beta_{1}\uwave{a_{0}} + \bbeta_{2}^{T}\bc)}
             {1 + \exp(\theta_{2} + \theta_{3}a_{1} + \beta_{0} + \beta_{1}\uwave{a_{0}} + \bbeta_{2}^{T}\bc)}\\
  B_{PNDE} &= \frac
             {    \exp(\theta_{2} + \theta_{3}a_{0} + \beta_{0} + \beta_{1}\uwave{a_{0}} + \bbeta_{2}^{T}\bc)}
             {1 + \exp(\theta_{2} + \theta_{3}a_{0} + \beta_{0} + \beta_{1}\uwave{a_{0}} + \bbeta_{2}^{T}\bc)}\\
      d_{1,PNDE} &= Q_{PNDE} - B_{PNDE}\\
      d_{2,PNDE} &= \uwave{a_{0}} (Q_{PNDE} - B_{PNDE})\\
      d_{3,PNDE} &= \bc (Q_{PNDE} - B_{PNDE})\\
      d_{4,PNDE} &= 0\\
      d_{5,PNDE} &= a_{1} - a_{0}\\
      d_{6,PNDE} &= Q_{PNDE} - B_{PNDE}\\
      d_{7,PNDE} &= a_{1}Q_{PNDE} - a_{0}B_{PNDE}\\
      d_{8,PNDE} &= \b0\\
  \Gamma_{PNDE}
  &= \frac{\partial PNDE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= \begin{bmatrix}
      d_{1,PNDE}\\
      d_{2,PNDE}\\
      d_{3,PNDE}\\
      d_{4,PNDE}\\
      d_{5,PNDE}\\
      d_{6,PNDE}\\
      d_{7,PNDE}\\
      d_{8,PNDE}\\
    \end{bmatrix}\\
  \\
  Q_{TNIE} &= \frac
      {    \exp(\theta_{2} + \theta_{3}\uwave{a_{1}} + \beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}
      {1 + \exp(\theta_{2} + \theta_{3}\uwave{a_{1}} + \beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}\\
  B_{TNIE} &= \frac
      {    \exp(\theta_{2} + \theta_{3}\uwave{a_{1}} + \beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}
      {1 + \exp(\theta_{2} + \theta_{3}\uwave{a_{1}} + \beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}\\
  K_{TNIE} &= \frac
      {    \exp(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}
      {1 + \exp(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}\\
  D_{TNIE} &= \theta_{3} \frac
      {    \exp(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}
      {1 + \exp(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}\\
  d_{1,TNIE} &= (D_{TNIE} + Q_{TNIE}) - (K_{TNIE} + B_{TNIE})\\
  d_{2,TNIE} &= a_{0}(D_{TNIE} - B_{TNIE}) + a_{1}(Q_{TNIE} - K_{TNIE})\\
  d_{3,TNIE} &= \bc \left\{ (D_{TNIE} + Q_{TNIE}) - (K_{TNIE} + B_{TNIE}) \right\}\\
  d_{4,TNIE} &= 0\\
  d_{5,TNIE} &= 0\\
  d_{6,TNIE} &= Q_{TNIE} - B_{TNIE}\\
  d_{7,TNIE} &= \uwave{a_{1}} (Q_{TNIE} - B_{TNIE})\\
  d_{8,TNIE} &= \b0\\
  \Gamma_{TNIE}
  &= \frac{\partial TNIE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= \begin{bmatrix}
      d_{1,TNIE}\\
      d_{2,TNIE}\\
      d_{3,TNIE}\\
      d_{4,TNIE}\\
      d_{5,TNIE}\\
      d_{6,TNIE}\\
      d_{7,TNIE}\\
      d_{8,TNIE}\\
    \end{bmatrix}\\
  \\
  Q_{TNDE} &= \frac
             {    \exp(\theta_{2} + \theta_{3}a_{1} + \beta_{0} + \beta_{1}\uwave{a_{1}} + \bbeta_{2}^{T}\bc)}
             {1 + \exp(\theta_{2} + \theta_{3}a_{1} + \beta_{0} + \beta_{1}\uwave{a_{1}} + \bbeta_{2}^{T}\bc)}\\
  B_{TNDE} &= \frac
             {    \exp(\theta_{2} + \theta_{3}a_{0} + \beta_{0} + \beta_{1}\uwave{a_{1}} + \bbeta_{2}^{T}\bc)}
             {1 + \exp(\theta_{2} + \theta_{3}a_{0} + \beta_{0} + \beta_{1}\uwave{a_{1}} + \bbeta_{2}^{T}\bc)}\\
      d_{1,TNDE} &= Q_{TNDE} - B_{TNDE}\\
      d_{2,TNDE} &= \uwave{a_{1}} (Q_{TNDE} - B_{TNDE})\\
      d_{3,TNDE} &= \bc (Q_{TNDE} - B_{TNDE})\\
      d_{4,TNDE} &= 0\\
      d_{5,TNDE} &= a_{1} - a_{0}\\
      d_{6,TNDE} &= Q_{TNDE} - B_{TNDE}\\
      d_{7,TNDE} &= a_{1}Q_{TNDE} - a_{0}B_{TNDE}\\
      d_{8,TNDE} &= \b0\\
  \Gamma_{TNDE}
  &= \frac{\partial TNDE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= \begin{bmatrix}
      d_{1,TNDE}\\
      d_{2,TNDE}\\
      d_{3,TNDE}\\
      d_{4,TNDE}\\
      d_{5,TNDE}\\
      d_{6,TNDE}\\
      d_{7,TNDE}\\
      d_{8,TNDE}\\
    \end{bmatrix}\\
  \\
  Q_{PNIE} &= \frac
      {    \exp(\theta_{2} + \theta_{3}\uwave{a_{0}} + \beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}
      {1 + \exp(\theta_{2} + \theta_{3}\uwave{a_{0}} + \beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}\\
  B_{PNIE} &= \frac
      {    \exp(\theta_{2} + \theta_{3}\uwave{a_{0}} + \beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}
      {1 + \exp(\theta_{2} + \theta_{3}\uwave{a_{0}} + \beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}\\
  K_{PNIE} &= \frac
      {    \exp(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}
      {1 + \exp(\beta_{0} + \beta_{1}a_{1} + \bbeta_{2}^{T}\bc)}\\
  D_{PNIE} &= \theta_{3} \frac
      {    \exp(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}
      {1 + \exp(\beta_{0} + \beta_{1}a_{0} + \bbeta_{2}^{T}\bc)}\\
  d_{1,PNIE} &= (D_{PNIE} + Q_{PNIE}) - (K_{PNIE} + B_{PNIE})\\
  d_{2,PNIE} &= a_{0}(D_{PNIE} - B_{PNIE}) + a_{1}(Q_{PNIE} - K_{PNIE})\\
  d_{3,PNIE} &= \bc \left\{ (D_{PNIE} + Q_{PNIE}) - (K_{PNIE} + B_{PNIE}) \right\}\\
  d_{4,PNIE} &= 0\\
  d_{5,PNIE} &= 0\\
  d_{6,PNIE} &= Q_{PNIE} - B_{PNIE}\\
  d_{7,PNIE} &= \uwave{a_{0}} (Q_{PNIE} - B_{PNIE})\\
  d_{8,PNIE} &= \b0\\
  \Gamma_{PNIE}
  &= \frac{\partial PNIE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= \begin{bmatrix}
      d_{1,PNIE}\\
      d_{2,PNIE}\\
      d_{3,PNIE}\\
      d_{4,PNIE}\\
      d_{5,PNIE}\\
      d_{6,PNIE}\\
      d_{7,PNIE}\\
      d_{8,PNIE}\\
    \end{bmatrix}\\
  \\
  \Gamma_{TE}
  &= \frac{\partial TE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= \frac{\partial (PNDE+TNIE)}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= \Gamma_{PNDE} + \Gamma_{TNIE}\\
  \\
  \Gamma_{PM}
  &= \frac{\partial PM}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &~~~\text{By multivariate chain rule}\\
  &= \frac{\partial PM}{\partial PNDE}\frac{\partial PNDE}{\partial (\bbeta^{T},\btheta^{T})^{T}} + \frac{\partial PM}{\partial TNIE}\frac{\partial TNIE}{\partial (\bbeta^{T},\btheta^{T})^{T}}\\
  &= \frac{\partial PM}{\partial PNDE}\Gamma_{PNDE} + \frac{\partial PM}{\partial TNIE}\Gamma_{TNIE}\\
  &= - \frac{\exp(PNDE)\left\{ \exp(TNIE) - 1 \right\}}{\left\{ \exp(PNDE)\exp(TNIE) - 1 \right\}^{2}} \Gamma_{PNDE}\\
  &~~~ + \frac{\exp(PNDE)\exp(TNIE)\left\{ \exp(PNDE) - 1 \right\}}{\left\{ \exp(PNDE)\exp(TNIE) - 1 \right\}^{2}} \Gamma_{TNIE}\\
  \\
  &\text{Variance-covariance matrix from two models}\\
  \bSigma &=
           \begin{bmatrix}
             \bSigma_{\bbeta} & 0 \\
             0 & \bSigma_{\btheta} \\
           \end{bmatrix}\\
  SE(\widehat{CDE}(m)) &= \sqrt{\Gamma_{CDE(m)}^{T} ~\bSigma~ \Gamma_{CDE(m)}}\\
  SE(\widehat{PNDE}) &= \sqrt{\Gamma_{PNDE}^{T} ~\bSigma~ \Gamma_{PNDE}}\\
  SE(\widehat{TNIE}) &= \sqrt{\Gamma_{TNIE}^{T} ~\bSigma~ \Gamma_{TNIE}}\\
  SE(\widehat{TNDE}) &= \sqrt{\Gamma_{TNDE}^{T} ~\bSigma~ \Gamma_{TNDE}}\\
  SE(\widehat{PNIE}) &= \sqrt{\Gamma_{PNIE}^{T} ~\bSigma~ \Gamma_{PNIE}}\\
  SE(\widehat{TE}) &= \sqrt{\Gamma_{TE}^{T} ~\bSigma~ \Gamma_{TE}}\\
  SE(\widehat{PM}) &= \sqrt{\Gamma_{PM}^{T} ~\bSigma~ \Gamma_{PM}}\\
\end{align*}


\section{Software}
\label{sec:org45087dc}
The detailed explanation of the software implementation is given on its website (\url{https://kaz-yos.github.io/regmedint/index.html}).

\section{Bibliography}
\label{sec:orgf6c8ae1}
\renewcommand{\section}[2]{}

\bibliographystyle{apalike}
\bibliography{../../../../../.emacs.d/misc/zotero}
\end{document}